<a href="https://colab.research.google.com/github/sejallotliker/python_pandas/blob/main/Section_4_Statistical_functions_in_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Pandas** **Library**

Course on udemy | Section-4

Author: `Sejal Lotliker`

Date: `11-06-2021`

In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.DataFrame(np.random.rand(6,3) ,columns = ['first', 'second', 'third'])
df.apply(np.mean)
print(df.apply(np.mean))

first     0.461441
second    0.617071
third     0.419859
dtype: float64

#Mean Function

In [4]:
# by passing axis parameter, operations can be row wise
df.apply(np.mean, axis=1)
print(df.apply(np.mean))

first     0.461441
second    0.617071
third     0.419859
dtype: float64

In [5]:
print(df.apply(np.mean, axis=1))

0    0.653892
1    0.458940
2    0.808806
3    0.317585
4    0.198009
5    0.559508
dtype: float64

In [6]:
#lambda function
df.apply(lambda x:x.max()-x.min())
print(df.apply(lambda x:x.max()-x.min()))

first     0.826047
second    0.893099
third     0.914932
dtype: float64

#covarience function

It is a measure of the relationship two random variables.

In [7]:
a1 = pd.Series(np.random.randn(8))
a2 = pd.Series(np.random.randn(8))
print(a1.cov(a2))

-0.15326824300340233

In [8]:
b = pd.DataFrame(np.random.randn(8,4), columns=['a1','a2','a3','a4'])
print(b['a1'].cov(b['a2']))
print(b.cov())

0.04963812622667186
          a1        a2        a3        a4
a1  0.825436  0.049638 -0.286919  0.332034
a2  0.049638  0.518707 -0.156409  0.213858
a3 -0.286919 -0.156409  0.331487 -0.081097
a4  0.332034  0.213858 -0.081097  0.981377

#Correlation Function

It shows linear relationship between two array of values.

In [9]:
a = pd.DataFrame(np.random.randn(10,5), columns =['a','b','c','d','e'])
print(a["e"].corr(a["a"]))
print(a.corr())

-0.2489518012494046
          a         b         c         d         e
a  1.000000 -0.065306 -0.254980  0.175529 -0.248952
b -0.065306  1.000000  0.092047  0.424293 -0.067751
c -0.254980  0.092047  1.000000 -0.196059 -0.226671
d  0.175529  0.424293 -0.196059  1.000000 -0.066090
e -0.248952 -0.067751 -0.226671 -0.066090  1.000000

In [10]:
b=pd.DataFrame(np.random.randn(8,4), columns=['a1','a2','a3','a4'])
print(b['a1'].corr(b['a2']))
print(b.corr())

# If any non-numeric column is present in the DataFrame, it is excluded automatically

0.5208478816145569
          a1        a2        a3        a4
a1  1.000000  0.520848  0.908645 -0.126358
a2  0.520848  1.000000  0.635717 -0.400779
a3  0.908645  0.635717  1.000000 -0.164096
a4 -0.126358 -0.400779 -0.164096  1.000000

#.rolling() function

This function can be applied to series of data. 

Specify the window = n arguement and apply the appropriate statistical function on top of it.

In [12]:
a = pd.DataFrame(np.random.randn(10,4), 
                 index=pd.date_range('1/1/2002', periods=10), #series of data
                 columns=['one','two','three','four'])

In [21]:
print(a.rolling(window=3).mean())

                 one       two     three      four
2002-01-01       NaN       NaN       NaN       NaN
2002-01-02       NaN       NaN       NaN       NaN
2002-01-03  0.292503 -0.168785  0.170845 -0.949238
2002-01-04  0.008136 -0.407385  0.624522 -0.226941
2002-01-05 -0.195272  0.075109  0.153940  0.218103
2002-01-06  0.771704  0.564963 -0.087786  0.648547
2002-01-07  0.002084  0.889700 -0.518103  0.846092
2002-01-08 -0.132351  0.652228  0.041380  0.140059
2002-01-09 -0.601075  0.461026  0.985906  0.102003
2002-01-10  0.225850  0.239232  0.501222 -0.375382

#.expanding function

This function can be applied on the series of data.
Specify the min_periods=n arguement and apply the appropriate statistical function on top of it.

In [25]:
b = pd.DataFrame(np.random.randn(12,5),
                 index = pd.date_range(2/2/2010, periods = 12),
                 columns = ['A','B','C','D','E'])

print(b.expanding(min_periods=3).mean())

                   A         B         C         D         E
1970-01-01       NaN       NaN       NaN       NaN       NaN
1970-01-02       NaN       NaN       NaN       NaN       NaN
1970-01-03  0.103657  0.148952 -0.329435 -0.298969  0.416718
1970-01-04  0.058914  0.243177  0.201956 -0.200557  0.582833
1970-01-05  0.146482  0.428906 -0.032620  0.058512  0.249203
1970-01-06  0.074495  0.689359  0.025401  0.117259  0.326995
1970-01-07  0.521142  0.620421  0.016125  0.002086  0.375981
1970-01-08  0.367516  0.638705  0.005362  0.098530  0.265568
1970-01-09  0.397481  0.505391 -0.283760  0.087528  0.372470
1970-01-10  0.377651  0.579064 -0.294750 -0.003322  0.265078
1970-01-11  0.406691  0.463200 -0.253821 -0.086800  0.244889
1970-01-12  0.456945  0.483831 -0.431174 -0.019193  0.163509

#melt() function

It is a function used to convert wide dataframes to narrow ones.

In [26]:
my_var= pd.DataFrame({'A':{0:'a',1:'b',2:'c'},
                      'B':{0:1, 1:3, 2:5},
                      'C':{0:2, 1:4, 2:6}})

In [27]:
my_var

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [28]:
pd.melt(my_var, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [31]:
pd.melt(my_var, id_vars=['A'], value_vars=['B','C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [32]:
pd.melt(my_var, id_vars=['A'], value_vars=['B'], var_name= 'myVarName',
        value_name='myValueName')

   A myVarName  myValueName
0  a         B            1
1  b         B            3
2  c         B            5